package com.company.hw;

//
//1) Создать по одной переменной каждого типа данных, который ты знаешь.
//2) Присвоить каждой переменной значение в диапазоне типа.
//3) Вывести значение каждой переменной в консоль, каждое значение выводить с новой строки.

import java.util.concurrent.atomic.AtomicInteger;

public class HW_02 {
    public static void main(String[] args) {
        byte y = 19;
        byte x = 3;
        System.out.println(y * x);

        short number1 = 23;
        short number2 = 54;
        short number3 = 10;
        System.out.print((number1 + number3) * number2);


        int cat=55555555;
        int dog=64246468;
        System.out.println(cat-dog);


        long apple1=1489122891;
        long plump1=482824884;
        System.out.println(apple1+plump1);


        double julia=-1.69;
        double vitalik=1.85;
        System.out.println(julia*vitalik);

        char bbc=10;
        char cnn=765;
        System.out.println(bbc*(cnn-bbc));

        


    }
}
